src/main/java/ok/dht/test/vihnin/resources/report/stage4/profile_results_t4_c60_mget_R30000/wrk_res.txt
Running 1m test @ http://localhost:19234
  4 threads and 60 connections
  Thread calibration: mean lat.: 924.143ms, rate sampling interval: 4317ms
  Thread calibration: mean lat.: 923.531ms, rate sampling interval: 4313ms
  Thread calibration: mean lat.: 923.468ms, rate sampling interval: 4313ms
  Thread calibration: mean lat.: 1072.521ms, rate sampling interval: 4448ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.60s     3.18s   13.89s    56.10%
    Req/Sec     5.82k   343.08     6.54k    65.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.75s 
 75.000%   11.60s 
 90.000%   12.65s 
 99.000%   13.52s 
 99.900%   13.81s 
 99.990%   13.87s 
 99.999%   13.89s 
100.000%   13.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2430.975     0.000000           26         1.00
    4153.343     0.100000       116368         1.11
    5390.335     0.200000       232940         1.25
    6590.463     0.300000       348927         1.43
    7434.239     0.400000       464853         1.67
    8749.055     0.500000       581812         2.00
    9289.727     0.550000       639129         2.22
    9764.863     0.600000       698117         2.50
   10518.527     0.650000       755459         2.86
   11026.431     0.700000       813892         3.33
   11599.871     0.750000       872388         4.00
   11919.359     0.775000       901101         4.44
   12075.007     0.800000       930217         5.00
   12206.079     0.825000       960184         5.71
   12353.535     0.850000       988333         6.67
   12517.375     0.875000      1018059         8.00
   12582.911     0.887500      1032658         8.89
   12648.447     0.900000      1045989        10.00
   12787.711     0.912500      1061145        11.43
   12886.015     0.925000      1075201        13.33
   13008.895     0.937500      1090239        16.00
   13049.855     0.943750      1097226        17.78
   13082.623     0.950000      1104475        20.00
   13131.775     0.956250      1111479        22.86
   13189.119     0.962500      1119119        26.67
   13262.847     0.968750      1125755        32.00
   13295.615     0.971875      1129396        35.56
   13328.383     0.975000      1133214        40.00
   13377.535     0.978125      1137154        45.71
   13418.495     0.981250      1141117        53.33
   13451.263     0.984375      1144497        64.00
   13467.647     0.985938      1145886        71.11
   13484.031     0.987500      1147552        80.00
   13508.607     0.989062      1149618        91.43
   13533.183     0.990625      1151434       106.67
   13557.759     0.992188      1153352       128.00
   13565.951     0.992969      1154095       142.22
   13574.143     0.993750      1154890       160.00
   13590.527     0.994531      1155964       182.86
   13606.911     0.995313      1156671       213.33
   13656.063     0.996094      1157581       256.00
   13672.447     0.996484      1158008       284.44
   13697.023     0.996875      1158537       320.00
   13705.215     0.997266      1158801       365.71
   13729.791     0.997656      1159285       426.67
   13746.175     0.998047      1159713       512.00
   13762.559     0.998242      1160026       568.89
   13770.751     0.998437      1160176       640.00
   13787.135     0.998633      1160506       731.43
   13795.327     0.998828      1160632       853.33
   13811.711     0.999023      1160959      1024.00
   13811.711     0.999121      1160959      1137.78
   13819.903     0.999219      1161135      1280.00
   13828.095     0.999316      1161269      1462.86
   13836.287     0.999414      1161436      1706.67
   13836.287     0.999512      1161436      2048.00
   13844.479     0.999561      1161545      2275.56
   13844.479     0.999609      1161545      2560.00
   13852.671     0.999658      1161643      2925.71
   13852.671     0.999707      1161643      3413.33
   13860.863     0.999756      1161781      4096.00
   13860.863     0.999780      1161781      4551.11
   13860.863     0.999805      1161781      5120.00
   13860.863     0.999829      1161781      5851.43
   13869.055     0.999854      1161885      6826.67
   13869.055     0.999878      1161885      8192.00
   13869.055     0.999890      1161885      9102.22
   13869.055     0.999902      1161885     10240.00
   13869.055     0.999915      1161885     11702.86
   13869.055     0.999927      1161885     13653.33
   13877.247     0.999939      1161896     16384.00
   13877.247     0.999945      1161896     18204.44
   13885.439     0.999951      1161919     20480.00
   13885.439     0.999957      1161919     23405.71
   13885.439     0.999963      1161919     27306.67
   13893.631     0.999969      1161959     32768.00
   13893.631     1.000000      1161959          inf
#[Mean    =     8602.150, StdDeviation   =     3176.837]
#[Max     =    13885.440, Total count    =      1161959]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1382398 requests in 1.00m, 6.52GB read
Requests/sec:  23040.13
Transfer/sec:    111.29MB